АлогистикТест2/src/InformationRegisters/алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов/алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов</name>
  <attributes>
    <name>ВременнаяМетка</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПериодРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОперацияПроизводства</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗначения</name>
    <type>
      <types>EnumRef.алк_ВидЗначенияПоказателяОтчетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов/ManagerModule.bsl
Процедура ДобавитьЗадание(ПериодРасчета, ОперацияПроизводства, ВидЗначения) Экспорт  
	
	//Если не указали дату в документе, то не добавляем задание в рс
	Если ПериодРасчета = Дата(1,1,1) Тогда   
		Возврат;
	КонецЕсли; 
	//\\
	
	НовыйПериод = ПериодРасчета;
	
	//если проводят документ в будущем
	Если ПериодРасчета > ТекущаяДата() Тогда 
		НовыйПериод = ТекущаяДата();
	КонецЕсли;    
	
	НоваяЗапись = РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ПериодРасчета = НовыйПериод;//ПериодРасчета;
	НоваяЗапись.ОперацияПроизводства = ОперацияПроизводства;
	НоваяЗапись.ВидЗначения = ВидЗначения;
	НоваяЗапись.ВременнаяМетка = ТекущаяДата();
	НоваяЗапись.Записать(Истина);
	
КонецПроцедуры
